Repository: CleoMenezesJr/Serigy
Catalog: po/*.po
Languages: it, ru

source: Pinned items in slots, with copy options and favorite status.
ru: Закреплённые элементы в ячейках с возможностью копирования и статусом избранного.

source: This structure contains an array of items, where each item is an array with three elements: a string (first item), a path to an image (second item), and a favorite indicator (third item).
it: Questa struttura contiene un insieme di elementi, dove ogni elemento è un insieme di tre elementi: una stringa (primo elemento), un percorso verso un'immagine (secondo elemento), e un indicatore per impostare come preferito (terzo elemento).
ru: Эта структура содержит массив элементов, где каждый элемент представляет собой массив из трёх элементов: строка (первый элемент), путь к изображению (второй элемент) и индикатор избранного (третий элемент).

source: Option to display the welcome window.
it: Opzione per visualizzare la finestra di benvenuto.
ru: Опция для отображения окна приветствия.

source: This key determines whether the welcome window is shown upon startup. The default value is set to true.
it: Questa chiave determina se la finestra di benvenuto viene visualizzata all'avvio. Il valore predefinito è impostato su true.
ru: клавиша определяет, будет ли отображаться окно приветствия при запуске. По умолчанию установлено значение true.

source: Option to auto arrange slots on change it.
ru: Опция автоматической расстановки слотов при изменении этого параметра.

source: Slots available for use.
ru: Доступные для использования слоты

source: By index; 0 = 6, 1 = 9, 2 = 12
ru: По индексу; 0 = 6, 1 = 9, 2 = 12

source: Pin your clipboard
it: Fissa i tuoi appunti
ru: Закрепите свой буфер обмена

source: Store important information from your clipboard selectively and securely, ensuring that only what you need is always within reach.
it: Conserva in modo selettivo e sicuro le informazioni importanti presenti nei tuoi appunti, così avrai sempre a portata di mano ciò che ti serve.
ru: Храните важную информацию в своём буфере обмена выборочно и надёжно, гарантируя, что только то, что вам нужно, всегда будет в пределах досягаемости.

source: Serigy window
it: Finestra di Serigy
ru: Окно Serigy

source: Copy window dialog
it: Finestra di dialogo per la copia
ru: Диалоговое окно копирования

source: Empty Clipboard
it: Appunti vuoto
ru: Пустой буфер обмена

source: Please copy some text or an image and try again.
it: Copia del testo o un'immagine e riprova.
ru: Пожалуйста, скопируйте какой-нибудь текст или изображение и повторите попытку.

source: Invalid Clipboard Format
it: Formato degli appunti non valido
ru: Недопустимый формат буфера обмена

source: {filename} file has unsupported format.
it: Il file {filename} contiene un formato non supportato.
ru: {filename} файл имеет неподдерживаемый формат.

source: Only text and image formats are supported.
it: Solo i formati testo ed immagini sono supportati.
ru: Поддерживаются только текстовые и графические форматы.

source: Pinning clipboard...
it: Appuntando...
ru: Закрепление буфера обмена...

# shortcut window
source: General
it: Generale
ru: Общие

# shortcut window
source: Show Shortcuts
it: Mostra scorciatoie
ru: Показывать комбинации клавиш

# shortcut window
source: Quit
it: Esci
ru: Выйти

source: Behavior
ru: Поведение

source: Auto Arrange Slots
ru: Автоматическое расположение слотов

source: Reorder slots based on changing data
ru: Изменение порядок слотов в зависимости от изменения данных

source: Number of Slots
ru: Количество слотов

source: Slots available for use
ru: Доступные для использования слоты

source: Privacy
ru: Конфиденциальность

source: Prefer to store the minimum amount of information to protect your privacy.
ru: Предпочтительно хранить минимальный объём информации для защиты вашей конфиденциальности.

source: Data
ru: Данные

source: Changing the number of slots will result in data loss.
ru: Изменение количества слотов приведет к потере данных.

source: Welcome to Serigy
it: Benvenuto su Serigy
ru: Добро пожаловать в Serigy

source: Please, carefully read and perform each step.
it: Si prega di leggere attentamente ed eseguire ogni passaggio.
ru: Пожалуйста, внимательно прочитайте и выполните каждый шаг.

source: Yes, I will do that
it: Si, lo farò
ru: Да, я так и сделаю

source: Scroll to start configuring...
it: Scorri per iniziare la configurazione...
ru: Прокрутите страницу, чтобы начать настройку...

source: How does it works?
it: Come funziona?
ru: Как это работает?

source: For security reasons, applications cannot access the clipboard unless their window is focused. Serigy will need to steal focus for 1 second by displaying a modal window.
it: Per motivi di sicurezza, le applicazioni non possono accedere agli appunti se la loro finestra non è focalizzata. Serigy dovrà creare attenzione per 1 secondo visualizzando una finestra modale.
ru: По соображениям безопасности приложения не могут получить доступ к буферу обмена, если их окно не сфокусировано. Serigy нужно будет отвлечь внимание на 1 секунду, отобразив модальное окно.

source: Shortcuts & limitations
it: Scorciatoie e limitazioni
ru: Быстрые пути и ограничения

source: To function as intended, a Serigy window must be opened using a shortcut.
it: Per funzionare come previsto, una finestra di Serigy deve essere aperta tramite una scorciatoia.
ru: Чтобы работать должным образом, необходимо открыть окно Serigy с помощью сочетания клавиш.

source: Creating shortcuts
it: Creazione delle scorciatoie
ru: Создание сочетания клавиш

source: Open the Settings app and navigate to <b>Keyboard</b> » <b>View and Customize Shortcuts</b> » <b>Custom Shortcuts</b> and create shortcuts with the following commands:
it: Apri le Impostazioni e vai su <b>Tastiera</b> » <b>Visualizza e personalizza le scorciatoie</b> » <b>Scorciatoie personalizzate</b> e crea scorciatoie con i seguenti comandi:
ru: Откройте приложение Настройки и перейдите в <b>Клавиатура</b> » <b>Просмотр и настройка сочетаний клавиш</b> » <b>Пользовательские сочетания клавиш</b> и создайте сочетания клавиш с помощью следующих команд:

source: Copy
it: Copia
ru: Копировать

source: Command to copy what is in the clipboard. Recommended is <b>Ctrl</b>+<b>Super</b>+<b>C</b>.
it: Comando per copiare quello che c'è negli appunti. Consiglio <b>Ctrl</b>+<b>Super</b>+<b>C</b>.
ru: Команда для копирования того, что находится в буфере обмена. Рекомендуется использовать <b>Ctrl</b>+<b>Super</b>+<b>C</b>.

source: Open Serigy
it: Apri Serigy
ru: Открыть Serigy

source: Command to copy what is in the clipboard. Recommended is <b>Ctrl</b>+<b>Super</b>+<b>V</b>.
it: Comando per copiare quello che c'è negli appunti. Consiglio <b>Ctrl</b>+<b>Super</b>+<b>V</b>.
ru: Команда для копирования того, что находится в буфере обмена. Рекомендуется использовать <b>Ctrl</b>+<b>Super</b>+<b>V</b>.

source: There's no magic
it: Non c'è nessuna magia
ru: Никакой магии

source: The data in your clipboard will not be pinned automatically when you copy something. Serigy will only pin the data you choose.
it: I dati nei tuoi appunti non verranno appuntati automaticamente quando copi qualcosa. Serigy appunterà solo i dati che scegli.
ru: Данные в вашем буфере обмена не будут автоматически закреплены при копировании чего-либо. Serigy закрепит только те данные, которые вы выберете.

source: That's all Folks!
it: E questo è tutto!
ru: Вот и все, ребята!

source: Please confirm all instructions have been followed to complete the setup.
it: Si prega di aver confermato tutte le istruzioni che hai seguito per completare la configurazione.
ru: Пожалуйста, убедитесь, что для завершения настройки были выполнены все инструкции.

source: Complete Setup
it: Conferma
ru: Завершить настройку

source: Empty
it: Svuota
ru: Пусто

source: Main Menu
it: Menù principale
ru: Главное меню

source: Loading...
it: Attendere...
ru: Загрузка...

source: Preferences
ru: Параметры

source: _Arrange Slots
it: _Riordina
ru: _Упорядочить слоты

source: _Keyboard Shortcuts
it: _Scorciatoie da tastiera
ru: _Сочетания клавиш

source: _About Serigy
it: _Informazioni su Serigy
ru: _О Serigy

source: Call copy function
it: Chiama funzione copia
ru: Вызов функции копирования

source: translator-credits
it: Sebastiano D'Angelo (NostalgicKitsune)
ru: Sultaniizov David <x1z53@alt-gnome.ru>

source: Donate
it: Dona
ru: Задонатить

source: Flatpak metainfo banner previewer
it: Anteprima sui banner
ru: Средство предварительного просмотра баннеров метаинформации Flatpak

source: Copied to clipboard
it: Copiato negli appunti
ru: Скопировано в буфер обмена

source: Empty slots?
it: Vuoi svuotare gli slot?
ru: Очистить слоты?

source: All information will be erased. Do you want to continue?
it: Tutte le informazioni verranno cancellate. Vuoi continuare?
ru: Вся информация будет удалена. Хотите продолжить?

source: Pinned items in clipboard history, with copy options and favorite status.
it: Elementi aggiunti alla cronologia appunti, con opzioni di copia e impostare come preferito.
